Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_find_*_files4.po
Languages: pt_br

source: <path:r>:line
pt_br: <path:r>:linha

source: <path>#N/<r>:line
pt_br: <path>#N/<r>:linha

source: <dir>#N/<file:r>:line
pt_br: <dir>#N/<file:r>:linha

source: To view/edit options install plugin "Options Editor"
pt_br: Para visualizar/editar opções, instalar o plugin "Editor de Opções"

source: [{}] Options
pt_br: [{}] Opções

source: Hotkeys
pt_br: Teclas de atalho

source: Speed
pt_br: Velocidade

source: Tricks
pt_br: Truques

source: Replace
pt_br: Substituir

source: Results
pt_br: Resultados

source: History
pt_br: Histórico

source: Search
pt_br: Pesquisar

source: [{}] Help
pt_br: [{}] Ajuda

source: No presets to run
pt_br: Sem predefinições para executar

source: Choose preset to run
pt_br: Escolher predefinição para executar

source: detect
pt_br: detectar

source: A&ge of files
pt_br: Ida&de dos arquivos

source: day(s)
pt_br: dia(s)

source: hour(s)
pt_br: hora(s)

source: month(s)
pt_br: mês

source: week(s)
pt_br: semana(s)

source: year(s)
pt_br: ano(s)

source: +1 level
pt_br: +1 nível

source: +2 levels
pt_br: +2 níveis

source: +3 levels
pt_br: +3 níveis

source: +4 levels
pt_br: +4 níveis

source: +5 levels
pt_br: +5 níveis

source: +All subfolders
pt_br: +Todas as subpastas

source: Only start dir
pt_br: Somente diretório inicial

source: S&ort collected files
pt_br: Classificar arquiv&os coletados

source: Don'&t sort
pt_br: &Não classificar

source: S&ort, newest first
pt_br: Classificar, mais recente primeir&o

source: Sort, o&ldest first
pt_br: Classificar, mais an&tigo primeiro

source: Skip &hidden/binary files
pt_br: Pular arquivos &ocultos/binários

source: Don'&t skip
pt_br: Não p&ular

source: Skip &binary
pt_br: Pular &binário

source: Skip &hidden
pt_br: Pular &oculto

source: Skip hidden &and binary
pt_br: Pular oculto &e binário

source: S&yntax elements (slowdown)
pt_br: Elementos de S&intaxe (desaceleração)

source: Inside &comment
pt_br: Dentro do &comentário

source: Outside of c&omment
pt_br: Fora do c&omentário

source: Inside literal &string
pt_br: Dentro da &string literal

source: Outside of literal s&tring
pt_br: Fora da st&ring literal

source: Create
pt_br: Criar

source: Save
pt_br: Salvar

source: Create new preset
pt_br: Criar nova predefinição

source: View preset
pt_br: Visualizar predefinição

source: Form position
pt_br: Posição do formulário

source: Form sizes and Results height
pt_br: Tamanhos do formulário e Altura dos resultados

source: >Na&me:
pt_br: >No&me:

source: Age:
pt_br: Idade:

source: &All ages
pt_br: &Todas idades

source: Search in files with the age (0 - in all)
pt_br: Pesquisar em arquivos com a idade (0 - em tudo)

source: Encoding for files
pt_br: Codificação para arquivos

source: Remove all and save?
pt_br: Remover tudo e salvar?

source: &Add
pt_br: &Adicionar

source: &Remove
pt_br: &Remover

source: File mask and encodings
pt_br: Máscara de arquivo e codificações

source: (analyze file content)
pt_br: (analisar o conteúdo do arquivo)

source: Source encoding for step
pt_br: Codificação da fonte para etapa

source: &Before:
pt_br: &Antes:

source: A&fter:
pt_br: De&pois:

source: Extra context lines
pt_br: Linhas extras de contexto

source: No yet executed searches
pt_br: Nenhuma pesquisa ainda executada

source: No more executed searches
pt_br: Sem mais pesquisas executadas

source: Executed parameters ({}/{}) is restored
pt_br: Os parâmetros executados ({}/{}) estão restaurados

source: Preset to apply
pt_br: Predefinição para aplicar

source: Preset is saved:
pt_br: Predefinição salva:

source: No preset
pt_br: Sem predefinição

source: Remove preset
pt_br: Excluir predefinição

source: Preset is removed:
pt_br: Predefinição removida:

source: Preset is loaded:
pt_br: Predefinição carregada:

source: Choose file to find in it
pt_br: Escolher o arquivo para encontrar nele

source: Initial search folder
pt_br: Pasta de pesquisa inicial

source: "Replace" is only for single-line Find pattern
pt_br: "Substituir" somente para padrão Localizar em linha única

source: "Replace" is only for "-?+?" mode
pt_br: "Substituir" somente para modo "-? +?"

source: "Replace" is for "Syntax elements" turned off
pt_br: "Substituir" para "Elementos de sintaxe " desativado

source: "Replace" is for "Lexer path for all fragments" turned off
pt_br: "Substituir" para "Caminho do lexer para todos fragmentos " desativado

source: Replace all in files/tabs?
pt_br: Substituir tudo em arquivos/guias?

source: With
pt_br: Com

source: Pattern to replace with.To substitute found RegEx groups: \1, \2, ...To substitute the entire match: \g<0> or \0
pt_br: Padrão a ser substituído com.Para substituir grupos RegEx encontrados: \1, \2, ...Para substituir ocorrência inteira: \g<0> ou \0

source: Click or F4 - Start replacementsShift+Click or Shift+F4 - Start emulation: show report of replacements and do not make changes.
pt_br: Clicar ou F4 - Inicia substituiçõesShift+Clique ou Shift+F4 - Inicia emulação: exibe relatório de substituições e não faz alterações.

source: Click or Shift+F4 - Start emulation: show report of replacements and do not make changes.
pt_br: Clicar ou Shift+F4 - Inicia emulação: exibe relatório de substituições e não faz alterações.

source: &Emulate
pt_br: &Emular

source: R&eplace
pt_br: S&ubstituir

source: With:
pt_br: Com:

source: Replace (EMULATION)
pt_br: Substituir (EMULAÇÃO)

source: Fill the field "{}"
pt_br: Preencher o campo "{}"

source: masks
pt_br: máscaras

source: Reset a&ll
pt_br: Restaurar &tudo

source: En&codings plan:
pt_br: Plano de en&codificações:

source: Set masks
pt_br: Definir máscaras

source: Step &1: {}
pt_br: Etapa &1: {}

source: Step &2: {}
pt_br: Etapa &2: {}

source: Step &3: {}
pt_br: Etapa &3: {}

source: Use &default steps: {}
pt_br: Utilizar as etapas &padrão: {}

source: Show relati&ve paths
pt_br: Exibir caminhos relati&vos

source: Show &modification time
pt_br: Exibir data de &modificação

source: Results &tree:
pt_br: Árvore de resul&tados:

source: Show le&xer path for all fragments (slowdown)
pt_br: Exibir caminho do le&xer para todos fragmentos (lentidão)

source: Add le&xer path to file path in the statusbar
pt_br: Adicionar caminho do lexer para caminho do arquivo na barra de status

source: Go to next found fragment
pt_br: Ir para o próximo fragmento encontrado

source: Go to prev found fragment
pt_br: Ir para o fragmento anterior encontrado

source: Go to next tab/file found fragment
pt_br: Ir para próxima guia/arquivo do fragmento encontrado

source: Go to prev tab/file found fragment
pt_br: Ir para guia/arquivo anterior do fragmento encontrado

source: Open found fragment in tab
pt_br: Abrir fragmento encontrado na guia

source: Prepare to search in the So&urce
pt_br: Preparar para pesquisar na Fon&te

source: Prepare to search in the Sou&rce and the lexer path
pt_br: Preparar para pesquisar na F&onte e no caminho do lexer

source: Copy Results to new tab
pt_br: Copiar resultados para nova guia

source: Choose start &folder
pt_br: Escolher pas&ta inicial

source: Choose fil&e to find in it
pt_br: Escolher arq&uivo para encontrar nele

source: C&ut last folder segment
pt_br: Cortar &último segmento da pasta

source: Use folder of the &current file
pt_br: Utilizar a pasta do &arquivo atual

source: Prepare a search in the current f&ile (on disk)
pt_br: Preparar uma pesquisa no ar&quivo atual (no disco)

source: Prepare a search in the current ta&b (in memory)
pt_br: Preparar uma pesquisa na &guia atual (na memória)

source: Prepare a search in &all tabs (in memory)
pt_br: Prepare uma pesquisa em tod&as as guias (na memória)

source: swaps with
pt_br: trocar com

source: Restore prev ({}/{}) executed parameters
pt_br: Restaurar parâmetros ({}/{}) executados anteriormente

source: Restore next ({}/{}) executed parameters
pt_br: Restaurar parâmetros ({}/{}) executados posteriormente

source: &Create new preset
pt_br: &Criar nova predefinição

source: &Remove preset
pt_br: &Remover predefinição

source: &View preset
pt_br: &Visualizar predefinição

source: Change preset &position
pt_br: Alterar &posição da predefinição

source: Choo&se preset
pt_br: E&scolher predefinição

source: &Append macro var
pt_br: &Anexar variável macro

source: Define n&ew custom var
pt_br: Definir n&ova variável personalizada

source: Chan&ge/remove custom var
pt_br: Alte&rar/remover variável personalizada

source: E&xpand all vars
pt_br: E&xpandir todas as variáveis

source: Help
pt_br: Ajuda

source: Sco&pe
pt_br: Esco&po

source: Pre&sets
pt_br: Predefiniçõe&s

source: Macro v&ars
pt_br: V&ariáveis Macro

source: Engine options.&..
pt_br: Opções do motor.&..

source: Replace with...
pt_br: Substituir com...

source: Emulate Replace with...
pt_br: Emular Substituir com...

source: Fast search (ignore some options)
pt_br: Pesquisa rápida (ignorar algumas opções)

source: Fragments?
pt_br: Fragmentos?

source: [Filtered /] Found fragments
pt_br: [Filtrado /] Fragmentos encontrados

source: Files?
pt_br: Arquivos?

source: Reported / Parsed [/ Stacked] files
pt_br: Arquivos Relatados / Analisados ​​[/ Empilhados]

source: Dirs?
pt_br: Diretórios?

source: Reported [/ Stacked] dirs
pt_br: Diretórios Relatados [/ Empilhados]

source: Timing?
pt_br: Tempo?

source: Last act duration
pt_br: Duração do último ato

source: Name "{}" is already used
pt_br: Nome "{}" já está sendo usado

source: &Name:
pt_br: &Nome:

source: Val&ue:
pt_br: Val&or:

source: Add &var
pt_br: Adicionar &variável

source: Add &path
pt_br: Adicionar &caminho

source: Remove
pt_br: Remover

source: Remove?
pt_br: Remover?

source: Append macro vars
pt_br: Anexar variáveis macro

source: Stop?
pt_br: Parar?

source: Fix quotes in the field "{}"
pt_br: Corrigir aspas no campo "{}"

source: Fix EOL in the field "{}"
pt_br: Corrigir EOL no campo "{}"

source: Set correct "{}" reg.ex. Error: {}
pt_br: Definir regex "{}" correto. Erro: {}

source: Set not included folders
pt_br: Definir pastas não incluídas

source: Emulation completed
pt_br: Emulação concluída

source: Emulation terminated
pt_br: Emulação encerrada

source: Replacements completed
pt_br: Substituições concluídas

source: Replacements terminated
pt_br: Substituições encerradas

source: Search completed
pt_br: Pesquisa concluída

source: Search terminated
pt_br: Pesquisa encerrada

source: Skip "{}" item: {}
pt_br: Pular "{}" item: {}

source: styles
pt_br: estilos

source: +EMULATION: Replace
pt_br: +EMULAÇÃO: Substituir

source: +Replace
pt_br: +Substituir

source: +Search
pt_br: +Pesquisa

source: when
pt_br: quando

source: . Report with
pt_br: . Relatar com

source: NOTE: Skipping option "skip hidden files/dirs". Pass the warning to app author.
pt_br: NOTA: Ignorando a opção "ignorar arquivos/diretórios ocultos". Passar aviso ao autor do aplicativo.

source: The option allows to save separate search settings (pattern, files mask, folders etc) per each mentioned session or project. Each item in the option is a pair (Prefix,RegEx). RegEx is compared with the full path of session (project) file. First matched item is used. Prefix is appended to keys. Example. If session path includes "cudatext" then value {"cuda":"cuda"} changes storing key "in_what" to "cuda:in_what"
pt_br: A opção permite salvar configurações de pesquisa separadas (padrão, máscara de arquivos, pastas etc) por cada sessão ou projeto mencionado. Cada item na opção é um par (Prefixo,RegEx). RegEx é comparado com caminho completo do arquivo da sessão (projeto). O primeiro item correspondente é usado. O prefixo é anexado às chaves. Exemplo. Se o caminho da sessão incluir "cudatext", o valor {"cuda":"cuda"} altera a chave de armazenamento "in_what" para "cuda:in_what"

source: Use selected text from document for the field "Find".
pt_br: Utilizar texto selecionado do documento para o campo "Localizar".

source: Start
pt_br: Iniciar

source: Append specified string to the field "Ex".
pt_br: Anexar string especificada ao campo "Ex".

source: Separate search stage, which collects all suitable files first.
pt_br: Estágio de pesquisa separado, que coleta todos os arquivos adequados primeiro.

source: Start file picking from the deepest folders.
pt_br: Comece a selecionar arquivos nas pastas mais profundas.

source: Allow comments in multi-line reg-exp. Whitespaces are ignored, except when in a character class or when preceded by an unescaped backslash. All characters from the leftmost "#" through the end of the line are ignored. Example. Single-line "\d\w+$" is same as multi-line reg-exp \d # Start digit \w+ # Some letters $ # End of source
pt_br: Permitir comentários em exp-reg multi-linha. Espaços em branco são ignorados, exceto quando em uma classe de caracteres ou quando precedidos por uma barra invertida sem escape. Todos os caracteres do "#" mais à esquerda até o final da linha são ignorados. Exemplo. Uma linha "\d\w+$" é o mesmo que exp-reg multi-linha \d # Dígito inicial \w+ # Algumas letras $ # Fim do documento

source: When reg-exp is off, option allows to separate pattern text into "parts" and search any/all of them: "|" - find any of right/left parts, "&" - find all of right/left parts. If pattern text has both symbols "|" and "&", "|" separates first. If the option is off, symbols "|" and "&" don't have special meaning.
pt_br: Quando reg-exp está desativado, a opção permite separar o texto do padrão em "partes" e pesquisar qualquer/todos deles: "|" - encontrar qualquer uma das partes direita/esquerda, "&" - encontrar todas as partes direita/esquerda. Se o texto padrão tiver os dois símbolos "|" e "&", "|" separa primeiro. Se a opção estiver desativada, os símbolos "|" e "&" não têm um significado especial.

source: Size of buffer (at file start) to detect binary files.
pt_br: Tamanho do buffer (no início do arquivo) para detectar arquivos binários.

source: If value>0, skip all files, which sizes are bigger than this value (in Kb).
pt_br: Se o valor>0, pula todos os arquivos, que os tamanhos são maiores que este valor (em Kb).

source: Default encoding to read files. If value is empty, then the following is used: cp1252 for Linux, preferred encoding from locale for others (Win, macOS, …).
pt_br: Codificação padrão para ler arquivos. Se o valor estiver vazio, o seguinte será usado: cp1252 para Linux, codificação preferencial de localidade para outros (Win, macOS, ...).

source: List of source file lexers. For these lexers extra filters and info will work as: Search by lexer tree path, Search inside/outside of comments and/or literal strings. Empty list - allow all lexers.
pt_br: Lista de arquivos de origem lexers. Para esses lexers, filtros e informações extras funcionarão como: Pesquisar pelo caminho da árvore lexer, Pesquisar dentro/fora dos comentários e/ou strings literais. Lista vazia - permitir todos os lexers.

source: List of lexers for Results. First available lexer is used.
pt_br: Lista de lexers para Resultados. O primeiro lexer disponível é usado.

source: Style to mark found fragment in the Results panel. Full form: "mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
pt_br: Estilo para marcar o fragmento encontrado no painel Resultados. Formulário completo: "mark_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Valores de cor: "" - ignorar, "#RRGGBB" - dígitos hexadecimais Valores para os lados da borda: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark found-to-replace fragment in the Results panel. Full form: "mark_fnd2rpl_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "font_strikeout":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
pt_br: Estilo para marcar fragmento encontrado para substituir no painel Resultados. Formulário completo: "mark_fnd2rpl_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "font_strikeout":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Valores de cor: "" - ignorar, "#RRGGBB" - dígitos hexadecimais Valores para os lados da borda: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark replaced fragment in the Results panel. Full form: "mark_replaced_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
pt_br: Estilo para marcar o fragmento substituído no painel Resultados. Formulário completo: "mark_replaced_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Valores de cor: "" - ignorar, "#RRGGBB" - dígitos hexadecimais Valores para os lados da borda: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Style to mark lexer path. Full form: "lex_path_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Color values: "" - skip, "#RRGGBB" - hex-digits Values for border sides: "solid", "dash", "2px", "dotted", "rounded", "wave"
pt_br: Estilo para marcar o caminho do Lexer. Formulário completo: "lex_path_style":{ "color_back":"", "color_font":"", "font_bold":false, "font_italic":false, "color_border":"", "borders":{"left":"","right":"","bottom":"","top":""} }, Valores de cor: "" - ignorar, "#RRGGBB" - dígitos hexadecimais Valores para os lados da borda: "solid", "dash", "2px", "dotted", "rounded", "wave"

source: Copy styles (color+bold/italic) from source lines to Results. Warning! The setting significantly slows down the search.
pt_br: Copiar estilos (cor+negrito/itálico) das linhas de origem para resultados. Aviso! A configuração deixa lento significativamente a pesquisa.

source: Maximum lines to copy styles from source lines to Results (0 - all). Warning! The big value significantly slows down the search.
pt_br: Máximo de linhas para copiar estilos de linhas de origem para Resultados (0 - todos). Aviso! Grande valor deixa lento significativamente a pesquisa.

source: Show first N fragments while search is in progress (min 10).
pt_br: Mostra os primeiros N fragmentos enquanto a pesquisa está em andamento (min 10).

source: Auto select first found fragment.
pt_br: Seleção automática do primeiro fragmento encontrado.

source: If N>0, do not show all files, which sizes are bigger than this N (in Kb).
pt_br: Se N>0, não mostra todos os arquivos, cujos tamanhos são maiores que este N (em Kb).

source: Height of dialog grid cell (min 25).
pt_br: Altura da célula da grade de diálogo (min 25).

source: Width of button "=" (min 15).
pt_br: Largura do botão "= " (min 15).

source: Width of button to switch regex/case/words (min 30).
pt_br: Largura do botão para alternar regex / case / words (min 30).

source: Minimal width of fields to set files/folders (min 150).
pt_br: Largura mínima de campos para definir arquivos / pastas (mínimo 150).

source: Statusbar height.
pt_br: Altura da barra de status.

source: Styles of statusbar fields.
pt_br: Estilos de campos da barra de status.

source: Sub-dialog "Replace" x-shift
pt_br: Sub-diálogo "Substituir " x-shift

source: Sub-dialog "Replace" y-shift
pt_br: Sub-diálogo "Substituir " y-shift

source: Full file path of log file (requires app restart).
pt_br: Caminho completo do arquivo de log (requer reinicialização do aplicativo).

source: Logging
pt_br: Exploração madeireira

source: Extra search options
pt_br: Opções extras de pesquisa

source: Options to view Results
pt_br: Opções para ver os resultados

source: F3/{u}F3 - next/prev fragment, ^F3/^{u}F3 - next/prev file fragment, Enter|DblClick - open.
pt_br: F3 / {u} F3 - fragmento seguinte / anterior, ^ F3 / ^ {u} F3 - fragmento de arquivo seguinte / anterior, Enter | DblClick - abrir.

source: Results.
pt_br: Resultados.

source: Source.
pt_br: Fonte.

source: Alt+Down - pattern history
pt_br: Alt + Down - histórico de padrões

source: Regular expression
pt_br: Expressão regular

source: Case sensitive
pt_br: Maiúsculas e Minúsculas

source: Whole words
pt_br: Palavras inteiras

source: Use multi-line input field
pt_br: Use o campo de entrada multilinha

source: Sort picked files by modification time. ↓↓ from newest. ↑↑ from oldest.
pt_br: Classificar arquivos por data de modificação. ↓↓ do mais recente. ↑↑ do mais antigo.

source: Fin&d
pt_br: En&contrar

source: Start search (F2) Shift+Click Start fast search (Shift+F2)
pt_br: Iniciar pesquisa (F2) Shift+Clique Iniciar pesquisa rápida (Shift+F2)

source: Space-separated file or folder masks. Folder mask starts with "/". Double-quote mask, which needs space char. Use "?" for any character and "*" for any fragment. Note: "*" matches all names, "*.*" doesn't match all.
pt_br: Arquivo separado por espaço ou máscaras de pasta. A máscara da pasta começa com "/". Máscara de aspas duplas, que precisa de caracteres de espaço. Usar "?" para qualquer caractere e "*" para qualquer fragmento. Nota: "*" corresponde a todos os nomes, "*.*" não corresponde a todos.

source: Always excluded: {} See engine option "always_not_in_files" to change.
pt_br: Sempre excluído: {} Consultar opção do motor "always_not_in_files" para alterar.

source: Exclude file[s]/folder[s]
pt_br: Excluir arquivo[s]/pasta[s]

source: Start folder(s). Space-separated folders. Double-quote folder, which needs space char. "~" is user home folder. {} or {{t}} to search in tabs. Ctrl+Shift+Up - cut last folder segment.
pt_br: Iniciar pasta(s). Pastas separadas por espaço. Pasta com aspas duplas, que precisa de caracteres de espaço. "~" é a pasta pessoal do usuário. {} ou {{t}} para pesquisar nas guias. Ctrl+Shift+Up - cortar último segmento da pasta.

source: Depth - how many folder levels to search. Use Ctrl+↑/↓ to change this option.
pt_br: Profundidade - quantos níveis de pasta para pesquisar. Utilizar Ctrl+↑/↓ para alterar esta opção.

source: Click or Ctrl+B Choose folder. Shift+Click or Ctrl+Shift+B Choose file to find in it.
pt_br: Clique ou Ctrl+B Escolher pasta. Shift+Clique ou Ctrl+Shift+B Escolher arquivo para encontrar nele.

source: All a&ges
pt_br: &Todas as idades

source: Show result line with its adjacent lines (above/below). "-N+M" - N lines above and M lines below. Turn option on to show config dialog.
pt_br: Exibir linha de resultado com suas linhas adjacentes (acima/abaixo). "-N+M" - N linhas acima e M linhas abaixo. Ativar opção para exibir caixa de diálogo de configuração.

source: {OTH4FND}. Use popup menu to change.
pt_br: {OTH4FND}. Utilizar o menu pop-up para alterar.

source: &Find:
pt_br: &Encontrar:

source: F&iles:
pt_br: Arqu&ivos:

source: Skip&:
pt_br: Pular&:

source: F&rom:
pt_br: D&e:

source: Pattern to find. It can be multi-line. Newline is shown as "§". Use Shift+Enter to append "§" at pattern end. Or switch to multi-line mode ("+") to see/insert natural newlines.
pt_br: Padrão para encontrar. Pode ser multi-linha. A nova linha é exibida como "§". Utilizar Shift+Enter para acrescentar "§" no final do padrão. Ou mudar para modo multi-linha ("+") para ver/inserir novas linhas naturais.

source: To search in tabs
pt_br: Para pesquisar nas guias

source: Folder(s) of the loaded project
pt_br: Pasta(s) do projeto carregado

source: Full path
pt_br: Caminho completo
