Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_exttools.po
Languages: pt_br

source: (Int, Default=4) Interpret output symbol TAB as "N spaces".
pt_br: (Int, Padrão=4) Interpretar o símbolo de saída TAB como "N espaços".

source: Set 8 for a tool likes "tidy"
pt_br: Definir 8 para uma ferramenta como "tidy"

source: Ignore
pt_br: Ignorar

source: Output panel
pt_br: Painel de saída

source: Output panel, append
pt_br: Painel de saída, anexar

source: Copy to new document
pt_br: Copiar para novo documento

source: Copy to new document, group 1
pt_br: Copiar para novo documento, grupo 1

source: Copy to new document, group 2
pt_br: Copiar para novo documento, grupo 2

source: Copy to new document, group 3
pt_br: Copiar para novo documento, grupo 3

source: Copy to clipboard
pt_br: Copiar para área de transferência

source: Replace selection
pt_br: Substituir seleção

source: Nothing
pt_br: Nada

source: Current document
pt_br: Documento atual

source: All documents
pt_br: Todos documentos

source: In tool properties "File name", "Parameters", "Initial folder" the following macros are processed. • Application: {AppDir} - Directory with app executable {AppDrive} - (Windows) Disk of app executable, eg "C:" • Currently focused file: {FileName} - Full path {FileDir} - Folder path, without file name {FileNameOnly} - Name only, without folder path {FileNameNoExt} - Name without extension and path {FileExt} - Extension {ContentAsTemp} - Name of [temporary] file with current text {Lexer} - Name of global lexer • Current file in group N (N is 1...6): {FileName_gN} - Full path {FileDir_gN} - Folder path, without file name {FileNameOnly_gN} - Name only, without folder path {FileNameNoExt_gN} - Name without extension and path {FileExt_gN} - Extension {ContentAsTemp_gN} - Name of [temporary] file with current text {Lexer_gN} - Name of global lexer • Currently focused editor (for top caret): {CurrentLine} - Text of caret's line {CurrentLineNum} - Index of caret's line {CurrentLineNum0} - Index of caret's line, 0-based {CurrentColumnNum} - Index of caret's column {CurrentColumnNum0}- Index of caret's column, 0-based {LexerAtCaret} - Name of lexer at caret position {SelectedText} - Text of selection {CurrentWord} - Word at caret position • Prompts: {Interactive} - Text will be asked at each running {InteractiveFile} - File name will be asked • Project: {PRJNAME} - If current project is loaded and has the PRJNAME var • OS environments: {OS:ENVNAME} - If OS has ENVNAME environment All macros can include suffix (function) to transform value. {Lexer|fun} - gets fun({Lexer}) {Lexer|fun:p1,p2} - gets fun({Lexer},p1,p2) {Lexer|f1st:p1,p2|f2nd} - gets f2nd(f1st({Lexer},p1,p2)) Predefined functions are: q - quote: "AB=?" -> "AB%3D%3F" u - upper: "word" -> "WORD" l - lower: "WORD" -> "word" t - title: "we he" -> "We He" All functions from all std Python modules can be used, but not methods. q is short form of urllib.parse.quote
pt_br: Nas propriedades da ferramenta "Nome do arquivo", "Parâmetros", "Pasta inicial" as seguintes macros serão processadas. • Aplicativo: {AppDir} - Diretório com executável {AppDrive} - (Windows) Disco do executável, por exemplo, "C:" • Arquivo focado no momento: {FileName} - Caminho completo {FileDir} - Caminho da pasta, sem nome de arquivo {FileNameOnly} - Somente nome, sem caminho da pasta {FileNameNoExt} - Nome sem extensão e caminho {FileExt} - Extensão {ContentAsTemp} - Nome do arquivo [temporário] com o texto atual {Lexer} - Nome do lexer global • Arquivo atual no grupo N (N é 1...6): {FileName_gN} - Caminho completo {FileDir_gN} - Caminho da pasta, sem nome de arquivo {FileNameOnly_gN} - Somente nome, sem caminho da pasta {FileNameNoExt_gN} - Nome sem extensão e caminho {FileExt_gN} - Extensão {ContentAsTemp_gN} - Nome do arquivo [temporário] com o texto atual {Lexer_gN} - Nome do lexer global • Editor atualmente focado (para cursor): {CurrentLine} - Texto da linha do cursor {CurrentLineNum} - Índice da linha do cursor {CurrentLineNum0} - Índice da linha do cursor, base 0 {CurrentColumnNum} - Índice da coluna do cursor {CurrentColumnNum0} - Índice da coluna do cursor, base 0 {LexerAtCaret} - Nome do lexer na posição do cursor {SelectedText} - Texto da seleção {CurrentWord} - Palavra na posição do cursor • Solicitações: {Interactive} - O texto será solicitado a cada execução {InteractiveFile} - O nome do arquivo será solicitado • Projeto: {PRJNAME} - Se o projeto atual for carregado e tiver a variável PRJNAME • Ambientes do SO: {OS:ENVNAME} - Se o sistema operacional tiver o ambiente ENVNAME Todas as macros podem incluir sufixo (função) para transformar o valor. {Lexer|fun} - obtém fun({Lexer}) {Lexer|fun:p1,p2} - obtém fun({Lexer},p1,p2) {Lexer|f1st:p1,p2|f2nd} - obtém f2nd(f1st({Lexer},p1,p2)) As funções predefinidas são: q - quote: "AB=?" -> "AB%3D%3F" u - upper: "palavra" -> "PALAVRA" l - lower: "WORD" -> "palavra" t - title: "nós ele" -> "Nós Ele" Todas as funções de todos os módulos padrão do Python podem ser usadas, mas não os métodos. q é a forma abreviada de urllib.parse.quote

source: Tool macros
pt_br: Macros

source: &Close
pt_br: &Fechar

source: Need update CudaText
pt_br: É necessário atualizar o CudaText

source: &Tools
pt_br: &Ferramentas

source: Con&fig...
pt_br: Con&figurar...

source: R&un main lexer tool
pt_br: Exec&utar principal ferramenta lexer

source: Resul&ts
pt_br: Resul&tados

source: &Next tool result
pt_br: Resultado da próxi&ma ferramenta

source: &Previous tool result
pt_br: Resultado da ferramenta &anterior

source: Main tool for lexer "{}" is not configured yet
pt_br: A ferramenta principal para o lexer "{} " ainda não está configurada

source: No URL: {}
pt_br: Sem URL: {}

source: Cannot open URL "{}" for untitled tab
pt_br: Não foi possível abrir URL "{} " para guia sem título

source: Opened "{}": {}
pt_br: Aberto "{}": {}

source: No tool: {}
pt_br: Sem ferramenta: {}

source: Tool "{}" is only for lexer(s): {}
pt_br: A ferramenta "{} " é somente para lexer(s): {}

source: Cancel running tool "{}"
pt_br: Cancelar ferramenta de execução "{} "

source: Cannot run tool "{}" for untitled tab
pt_br: Não foi possível executar a ferramenta "{} " para guia sem título

source: Run: "{}"
pt_br: Executar: "{}"

source: Fail running: {} {}
pt_br: Falha ao executar: {} {}

source: Run: {} {}
pt_br: Executar: {} {}

source: No tool to parse the output line
pt_br: Nenhuma ferramenta para analisar a linha de saída

source: Tool "{}" has not Pattern property
pt_br: A ferramenta "{} " não tem propriedade Padrão

source: Tool "{}" could not find a line-number into output line
pt_br: A ferramenta "{} " não encontrou um número de linha na linha de saída

source: Cannot open: {}
pt_br: Não foi possível abrir: {}

source: No any results for navigation
pt_br: Nenhum resultado para navegação

source: No more results for navigation
pt_br: Sem mais resultados para navegação

source: Join several tools to single tool
pt_br: Juntar várias ferramentas em uma única ferramenta

source: Use the URL
pt_br: Utilizar a URL

source: Move current tool to upper position
pt_br: Mover a ferramenta atual para a posição superior

source: Move current tool to lower position
pt_br: Mover a ferramenta atual para a posição inferior

source: For call by command "Run main lexer tool"
pt_br: Para chamar por comando "Executar a principal ferramenta lexer"

source: Edit list of user's macros to use in tool properties
pt_br: Editar lista de macros do usuário para utilizar nas propriedades da ferramenta

source: Change this dialog sizesCtrl+Click - Restore default values
pt_br: Alterar os tamanhos desta caixa de diálogoCtrl+Clique - Restaurar os valores padrão

source: Name
pt_br: Nome

source: Hotkey
pt_br: Tecla de atalho

source: File | [Tools]
pt_br: Arquivo | [Ferramentas]

source: Params
pt_br: Parâmetros

source: Folder
pt_br: Pasta

source: Capture
pt_br: Capturar

source: Saving
pt_br: Salvando

source: &Tools ({})
pt_br: &Ferramentas ({})

source: Expanded mac&ros
pt_br: Mac&ros expandido

source: &Edit...
pt_br: &Editar...

source: &Add...
pt_br: &Adicionar...

source: &Delete...
pt_br: &Excluir...

source: Clo&ne...
pt_br: Clo&nar...

source: Jo&in...
pt_br: Ju&ntar...

source: &Call
pt_br: &Chamar

source: Hotke&y...
pt_br: Tecla de atal&ho...

source: U&p
pt_br: A&cima

source: Do&wn
pt_br: Abai&xo

source: Set &main for lexers...
pt_br: Definir &principal para lexers...

source: User macro &vars...
pt_br: Macro de usuário e vars ...

source: Ad&just...
pt_br: A&justar...

source: Close
pt_br: Fechar

source: Tools and URLs ({})
pt_br: Ferramentas e URLs ({})

source: Delete URL?
pt_br: Excluir a URL?

source: Delete tool?
pt_br: Excluir a ferramenta?

source: Delete with joined tool(s)
pt_br: Excluir com ferramenta(s) associada(s)

source: Customization. Widths prefix "C"/"R" to align, "-" to hide.
pt_br: Customização. Prefixo de larguras "C "/"R " para alinhar, "- " para ocultar.

source: Width of Name (min 100)
pt_br: Largura do Nome (mín. 100)

source: Width of Keys (min 50)
pt_br: Largura das Teclas (mín. 50)

source: Width of File (min 150)
pt_br: Largura do Arquivo (mín. 150)

source: Width of Params (min 150)
pt_br: Largura dos Parâmetros (mín. 150)

source: Width of Folder (min 100)
pt_br: Largura da Pasta (mín. 100)

source: Width of Lexers (min 50)
pt_br: Largura dos Lexers (mín. 50)

source: Width of Capture (min 50)
pt_br: Largura de Captura (mín. 50)

source: Width of Saving (min 30)
pt_br: Largura de Salvar (min 30)

source: List height (min 200)
pt_br: Altura da lista (mín. 200)

source: Width of Url (min 500)
pt_br: Largura da Url (mín. 500)

source: &Lexer >>> main tool
pt_br: &Lexer >>> ferramenta principal

source: &Assign tool
pt_br: &Atribuir ferramenta

source: &Break link
pt_br: &Quebrar link

source: Main tool for lexers
pt_br: Ferramenta principal para lexers

source: Comment
pt_br: Comentário

source: Current value
pt_br: Valor atual

source: Expression
pt_br: Expressão

source: &Vars
pt_br: &Variáveis

source: Clo&ne
pt_br: Clo&nar

source: &Up
pt_br: &Acima

source: Pro&ject macros...
pt_br: Macros do pro&jeto...

source: Help
pt_br: Ajuda

source: User macros
pt_br: Macros do usuário

source: &Name:
pt_br: &Nome:

source: Val&ue:
pt_br: Val&or:

source: Add &file...
pt_br: Adicionar a&rquivo...

source: Add &dir...
pt_br: Adicionar &diretório...

source: Add &var...
pt_br: Adicionar &variável...

source: &Comment:
pt_br: &Comentário:

source: Cancel
pt_br: Cancelar

source: Edit user macro var
pt_br: Editar variável do macro do usuário

source: Set Name
pt_br: Definir nome

source: Set Value
pt_br: Definir valor

source: Delete Macro?
pt_br: Excluir Macro?

source: Name: {}
pt_br: Nome: {}

source: Value: {}
pt_br: Valor: {}

source: Comment: {}
pt_br: Comentário: {}

source: Select tools for join
pt_br: Selecionar ferramentas para unir

source: Hotkey:
pt_br: Atalho:

source: Pro&ject...
pt_br: Pro&jeto...

source: URL properties
pt_br: Propriedades da URL

source: Se&ries:
pt_br: Sé&ries:

source: &Select...
pt_br: &Selecionar...

source: Vie&w...
pt_br: E&xibir...

source: &Down
pt_br: &Abaixo

source: &File name:
pt_br: &Nome do arquivo:

source: &Browse...
pt_br: &Navegar...

source: &Shell command
pt_br: Comando do &shell

source: Run the tool via OS shell interpreter (e.g. Bash on Unix, Cmd on Windows)
pt_br: Executar ferramenta pelo interpretador shell do SO (p. ex., Bash no Unix, Cmd no Windows)

source: &Parameters:
pt_br: &Parâmetros:

source: A&dd...
pt_br: A&dicionar...

source: &Initial folder:
pt_br: &Pasta inicial:

source: B&rowse...
pt_br: Na&vegar...

source: Main for:
pt_br: Principal para:

source: Set &main...
pt_br: Definir &principal...

source: Sa&ve before:
pt_br: Sal&var antes:

source: &Capture output:
pt_br: Saída de &captura:

source: Encoding:
pt_br: Codificação:

source: S&elect...
pt_br: S&elecionar...

source: Pattern:
pt_br: Padrão:

source: Se&t...
pt_br: De&finir...

source: Advanced:
pt_br: Avançado:

source: Set...
pt_br: Definir...

source: Tool properties
pt_br: Propriedades da ferramenta

source: Set File name
pt_br: Definir nome do arquivo

source: Select lexers
pt_br: Selecionar lexers

source: Encodings
pt_br: Codificações

source: Advanced properties
pt_br: Propriedades avançadas

source: &Regular expression:
pt_br: &Expressão regular:

source: Append named group
pt_br: Anexar grupo nomeado

source: Test "&Output line":
pt_br: Testar "&Linha de saída":

source: &Test
pt_br: &Testar

source: Testing results
pt_br: Resultados do teste

source: Filename:
pt_br: Nome do arquivo:

source: Line:
pt_br: Linha:

source: Column:
pt_br: Coluna:

source: Load &preset...
pt_br: Carregar &predefinição...

source: &Save as preset...
pt_br: &Salvar como predefinição...

source: Tool "{}" output pattern
pt_br: Padrão de saída da ferramenta "{}"

source: Filename (default - current file name)
pt_br: Nome do arquivo (padrão - nome do arquivo atual)

source: Number of line (default - 1)
pt_br: Número da linha (padrão - 1)

source: Number of column (default - 1)
pt_br: Número da coluna (padrão - 1)

source: Number of line (0-based, default - 0)
pt_br: Número de linha (base 0, padrão - 0)

source: Number of column (0-based, default - 0)
pt_br: Número da coluna (base 0, padrão - 0)

source: Pattern variables
pt_br: Variáveis ​​padrão

source: Ready patterns
pt_br: Padrões prontos

source: Set "Regular expression"
pt_br: Definir "Expressão regular"

source: Name for preset ({})
pt_br: Nome para predefinição ({})

source: Param for call {}
pt_br: Parâmetro para chamar {}

source: {AppDir} Directory with app executable
pt_br: {AppDir} Diretório com executável

source: {AppDrive} (Win only) Disk of app executable, eg "C:"
pt_br: {AppDrive} (somente Windows) Disco do executável, por exemplo, "C: "

source: {FileName} Full path
pt_br: {FileName} Caminho completo

source: {FileDir} Folder path, without file name
pt_br: {FileDir} Caminho da pasta, sem nome de arquivo

source: {FileNameOnly} File name only, without folder path
pt_br: {FileNameOnly} Somente nome do arquivo, sem caminho da pasta

source: {FileNameNoExt} File name without extension and path
pt_br: {FileNameNoExt} Nome do arquivo sem extensão e caminho

source: {FileExt} Extension
pt_br: {FileExt} Extensão

source: {ContentAsTemp} Name of [temporary] file with current text
pt_br: {ContentAsTemp} Nome do arquivo [temporário] com o texto atual

source: {Lexer} File lexer
pt_br: {Lexer} Arquivo lexer

source: {LexerAtCaret} Local lexer (at 1st caret)
pt_br: {LexerAtCaret} Lexer local (no primeiro cursor)

source: {CurrentLine} Text of current line
pt_br: {CurrentLine} Texto da linha atual

source: {CurrentLineNum} Number of current line
pt_br: {CurrentLineNum} Número da linha atual

source: {CurrentLineNum0} Number of current line (0-based)
pt_br: {CurrentLineNum0} Número da linha atual (base 0)

source: {CurrentColumnNum} Number of current column
pt_br: {CurrentColumnNum} Número da coluna atual

source: {CurrentColumnNum0} Number of current column (0-based)
pt_br: {CurrentColumnNum0} Número da coluna atual (base 0)

source: {SelectedText} Text
pt_br: {SelectedText} Texto

source: {CurrentWord} Text
pt_br: {CurrentWord} Texto

source: {Interactive} Text will be asked at each running
pt_br: {Interactive} O texto será solicitado a cada execução

source: {InteractiveFile} File name will be asked
pt_br: {InteractiveFile} Nome do arquivo será solicitado

source: {{FileName_g{0}}} Full path of current file in group {0}
pt_br: {{FileName_g {0}}} Caminho completo do arquivo atual no grupo {0}

source: {{FileDir_g{0}}} Folder path, without file name, of current file in group {0}
pt_br: {{FileDir_g {0}}} Caminho da pasta, sem nome de arquivo, do arquivo atual no grupo {0}

source: {{FileNameOnly_g{0}}} File name only, without folder path, of current file in group {0}
pt_br: {{FileNameOnly_g {0}}} Somente o nome do arquivo, sem caminho da pasta, do arquivo atual no grupo {0}

source: {{FileNameNoExt_g{0}}} File name without extension and path of current file in group {0}
pt_br: {{FileNameNoExt_g {0}}} Nome do arquivo sem extensão e caminho do arquivo atual no grupo {0}

source: {{FileExt_g{0}}} Extension of current file in group {0}
pt_br: {{FileExt_g {0}}} Extensão do arquivo atual no grupo {0}

source: {{ContentAsTemp_g{0}}} Name of [temporary] file with current text in group {0}
pt_br: {{ContentAsTemp_g {0}}} Nome do arquivo [temporário] com o texto atual no grupo {0}

source: {{Lexer_g{0}}} Lexer of current file in group {0}
pt_br: {{Lexer_g {0}}} Lexer do arquivo atual no grupo {0}

source: Variables
pt_br: Variáveis

source: Adjust vertical alignments
pt_br: Ajustar alinhamentos verticais

source: &Save
pt_br: &Salvar

source: Apply the fittings to controls of all dialogs.Ctrl+Click - Show data to mail report.
pt_br: Aplicar os ajustes aos controles de todos os diálogos.Ctrl+Clique - Exibir os dados para enviar relatório.

source: Report
pt_br: Relatório

source: Send the report to the address
pt_br: Enviar o relatório para o endereço

source: or post it on
pt_br: ou postar no
