Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_macros.po
Languages: pt_br

source: Repeated values in cudatext_cmd.py
pt_br: Valores repetidos em cudatext_cmd.py

source: Need update CudaText
pt_br: É necessário atualizar o CudaText

source: &Start record
pt_br: &Iniciar gravação

source: St&op record
pt_br: Pa&rar gravação

source: &Cancel record
pt_br: &Cancelar gravação

source: &Export...
pt_br: &Exportar...

source: &Import...
pt_br: &Importar...

source: No macros for export
pt_br: Sem macros para exportação

source: Export &to
pt_br: Expor&tar para

source: Check &all
pt_br: Verificar &todos

source: U&ncheck all
pt_br: Des&marcar todos

source: &Export
pt_br: &Exportar

source: Close
pt_br: Fechar

source: Export macros
pt_br: Exportar macros

source: Select some names
pt_br: Selecionar alguns nomes

source: CudaText macros|*.cuda-macros|All file|*.*
pt_br: CudaText macros|*.cuda-macros|Todos os arquivos|*.*

source: No macros in file {} Choose another file?
pt_br: Sem macros no arquivo {} Escolher outro arquivo?

source: Macros from "{}" are recorded in CudaText with version "{}" Your CudaText has older version "{}" No guarantee of correct working! Continue import?
pt_br: Macros de "{}" são gravados no CudaText com a versão "{}" Seu CudaText tem uma versão mais antiga "{}" Nenhuma garantia de funcionamento correto! Continuar a importação?

source: Import &from
pt_br: Impo&rtar de

source: &Import
pt_br: &Importar

source: Import macros
pt_br: Importar macros

source: Import macros:
pt_br: Importar macros:

source: Skip duplicates:
pt_br: Pular duplicados:

source: &Stop record
pt_br: &Parar gravação

source: Hot&keys...
pt_br: Teclas de atal&ho...

source: Re&name...
pt_br: Re&nomear...

source: &Delete...
pt_br: &Excluir...

source: &Run!
pt_br: &Executar!

source: &Times
pt_br: &Tempo

source: &Wait
pt_br: &Aguardar

source: sec
pt_br: seg

source: While text c&hanges
pt_br: Enquanto o texto está pendurado

source: Until c&aret on last line
pt_br: Até o cur&sor na última linha

source: Canc&el record
pt_br: Canc&elar gravação

source: Show actions
pt_br: Exibir ações

source: Ad&just...
pt_br: A&justar...

source: Custom dialog Macros
pt_br: Diálogo personalizado Macros

source: Height of macro list (min 450)
pt_br: Altura da lista de macros (mín. 450)

source: Width of macro list (min 200)
pt_br: Largura da lista de macros (mín. 200)

source: Width of action list (min 200, <=0-hide)
pt_br: Largura da lista de ações (mín. 200, <= 0-ocultar)

source: Width of buttons (min 150)
pt_br: Largura dos botões (mín. 150)

source: Max run times (min 100)
pt_br: Tempos máximos de execução (mín. 100)

source: Select macro
pt_br: Selecionar macro

source: New name for: {}
pt_br: Novo nome para: {}

source: Select other name. Macro names now are:
pt_br: Selecionar outro nome. Os nomes das macros agora são:

source: Delete macro {}
pt_br: Excluir macro {}

source: Select stop condition
pt_br: Selecionar a condição de parada

source: Empty record
pt_br: Gravação vazia

source: Macro name. Tricks: "!NM" overwrite NM, "=NM" show NM in dialog
pt_br: Nome da macro. Truques: "!NM " sobrescrever NM, "=NM " exibir NM na caixa de diálogo

source: Select other name. Macros names now:
pt_br: Selecionar outro nome. Nomes de macros agora:

source: No macros: {}
pt_br: Sem macros: {}

source: Macro "{}" playback time is too long
pt_br: O tempo de reprodução da macro "{} " está muito longo

source: Wait &another {} sec
pt_br: Aguardar outro {} seg

source: Continue &without control
pt_br: Continuar &sem controle

source: &Cancel playback [ESC]
pt_br: &Cancelar a reprodução [ESC]

source: Macro playback
pt_br: Reprodução macro

source: Playback macro
pt_br: Reprodução da macro
