Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_project_man.po
Languages: pt_br

source: CudaText projects|*
pt_br: CudaText projetos|*

source: (Unsaved project)
pt_br: (Projeto não salvo)

source: New project
pt_br: Novo projeto

source: Open project...
pt_br: Abrir projeto...

source: Recent projects
pt_br: Projetos recentes

source: Save project as...
pt_br: Salvar projeto como...

source: Add folder...
pt_br: Adicionar pasta...

source: Add file...
pt_br: Adicionar arquivo...

source: Clear project
pt_br: Limpar projeto

source: Remove node
pt_br: Remover nó

source: New file...
pt_br: Novo arquivo...

source: Rename...
pt_br: Renomear...

source: Delete directory
pt_br: Excluir diretório

source: New directory...
pt_br: Novo diretório...

source: Find in directory...
pt_br: Encontrar no diretório...

source: Delete file
pt_br: Excluir arquivo

source: Set as main file
pt_br: Definir como arquivo principal

source: Refresh
pt_br: Atualizar

source: Go to file...
pt_br: Ir para o arquivo...

source: Project properties...
pt_br: Propriedades do projeto...

source: Config...
pt_br: Configurar...

source: Open project
pt_br: Abrir projeto

source: Save project as
pt_br: Salvar projeto como

source: Add folder
pt_br: Adicionar pasta

source: Add file
pt_br: Adicionar arquivo

source: Config
pt_br: Configurar

source: Project file
pt_br: Arquivo do projeto

source: Root nodes
pt_br: Nós raiz

source: Selected file
pt_br: Arquivo selecionado

source: Selected directory
pt_br: Diretório selecionado

source: Adding to project:
pt_br: Adicionando ao projeto:

source: New file:
pt_br: Novo arquivo:

source: Incorrect file name
pt_br: Nome do arquivo incorreto

source: Rename to
pt_br: Renomear para

source: Renamed to:
pt_br: Renomeado para:

source: Delete file from disk:
pt_br: Excluir arquivo do disco:

source: Deleted file:
pt_br: Excluir arquivo:

source: Delete directory from disk:
pt_br: Excluir diretório do disco:

source: Deleted dir:
pt_br: Excluir diretório:

source: New directory
pt_br: Novo diretório

source: Called "Find in Files" for "%s"
pt_br: "Find in Files" chamado por "%s"

source: Called "Find in Files 4" for "%s"
pt_br: "Find in Files 4" chamado por "%s"

source: Plugin "Find in Files" or "Find in Files 4" is not installed, install it first
pt_br: O plugin "Find in Files" ou "Find in Files 4" não está instalado, instale-o primeiro

source: Loading project:
pt_br: Carregando projeto:

source: Project opened:
pt_br: Projeto aberto:

source: Project filename is not found:
pt_br: O nome do arquivo do projeto não foi encontrado:

source: Saving project:
pt_br: Salvando projeto:

source: Project saved
pt_br: Projeto salvo

source: Project Manager: folder is locked:
pt_br: Gerenciador de Projetos: a pasta está bloqueada:

source: Project Manager: folder not found:
pt_br: Gerenciador de Projetos: a pasta não foi encontrada:

source: ProjectManager: saving options
pt_br: Gerenciador de Projetos: opções de salvamento

source: Project not loaded
pt_br: Projeto não carregado

source: Project not opened
pt_br: Projeto não aberto

source: Project is empty
pt_br: Projeto está vazio

source: Go to file
pt_br: Ir para o arquivo

source: Jumping to:
pt_br: Pular para:

source: Cannot jump to file:
pt_br: Não foi possível pular para o arquivo:

source: Project Manager: bad icons folder name: "%s"
pt_br: Gerenciador de Projetos: nome da pasta de ícones ruim: "%s"

source: Project Manager: bad icons size: "%s"
pt_br: Gerenciador de Projetos: tamanho dos ícones ruim: "%s"

source: ProjectManager: incorrect filetype icon:
pt_br: Gerenciador de Projetos: ícone do tipo de arquivo incorreto:

source: Project main file is not set
pt_br: Arquivo principal do projeto não está definido

source: Open all %d file(s) in editor?
pt_br: Abrir todos os %d arquivo(s) no editor?

source: Ignore &files:
pt_br: Ignorar ar&quivos:

source: Ignore fold&ers:
pt_br: Ignorar pas&tas:

source: Ignore all &hidden files/folders
pt_br: Ignorar todos arquivos/diretórios ocultos

source: &Recent projects:
pt_br: Projetos &recentes:

source: &Load on app start, reopen last project (*)
pt_br: Carregar na inicialização do programa, reabrir o último projeto (*)

source: &Show toolbar
pt_br: E&xibir a barra de ferramentas

source: Open file after "&Go to file" command
pt_br: Abrir o arquivo após o comando "&Ir para o arquivo"

source: &Use "preview tab" on item clicking
pt_br: &Utilizar "visualização de guia" ao clicar no item

source: Open files by &double-click
pt_br: Abrir arquivos com clique &duplo

source: On opening file in Git/SVN repo, create project from repo (*)
pt_br: Ao abrir o arquivo no repositório Git/SVN, criar um projeto a partir do repositório (*)

source: File type icons:
pt_br: Ícones do tipo de arquivo:

source: Toolbar icons:
pt_br: Ícones da barra de ferramentas:

source: For more icons, get add-ons of kind "filetypeicons", "projtoolbaricons"
pt_br: Para mais ícones, obter complementos do tipo "filetypeicons", "projtoolbaricons"

source: (*) - requires CudaText restart
pt_br: (*) - precisa reiniciar o CudaText

source: Cancel
pt_br: Cancelar

source: Project Manager options
pt_br: Opções do Gerenciador de Projetos

source: &Variables (in form Name=Value)
pt_br: &Variáveis (na forma Nome=Valor)

source: &Main file (read-only, change in context menu)
pt_br: &Arquivo principal (somente-leitura, alterar no menu de contexto)

source: Project properties
pt_br: Propriedades do projeto
