Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_find_*_files4.po
Languages: pt_br

source: File folder path
pt_br: Caminho da pasta do arquivo

source: File name only, without folder path
pt_br: Somente o nome do arquivo, sem caminho da pasta

source: File name without extension and path
pt_br: Nome do arquivo sem extensão e caminho

source: File extension
pt_br: Extensão de arquivo

source: Text of current line
pt_br: Texto da linha atual

source: Selected text
pt_br: Texto selecionado

source: Text of current word
pt_br: Texto da palavra atual

source: Plugin provides ... ———————————————————————————————————————————————————————————————————————————————————————————— String to replace (pattern) can include macro variable. Use Ctrl+A to view all variables, select and append one. In single-line control the newlines are shown as §. ———————————————————————————————————————————————————————————————————————————————————————————— Long-term replacements can be interrupted by ESC.
pt_br: Provedor Plugin... ————————————————————————————————————————————————————————————————————————————————————————————— A string a ser substituída (padrão) pode incluir variável de macro. Use Ctrl+A para visualizar todas as variáveis, selecione e acrescentar uma. No controle de linha única, as novas linhas são exibidas como §. ——————————————————————--------------------------------------------------------------------—————————————————————————— Substituições de longa duração podem ser interrompidas por ESC.

source: Some of the search parameters slightly decrease the search speed. Others reduce the speed dramatically. To perform optimal search, you better consider these notes. 1. The parameters .* {reex} aA {case} "w" {word} do not reduce the speed at all. 2. Using non-trivial setttings of "Sort collected files" or "Age of files" basically does not reduce the speed. 3. Appending context lines to Results ("-?+?") slightly decreases the speed. 4. Multi-line pattern ("+") noticeably decreases the speed. 5. Inappropriate "Encoding plan" can greatly reduce the speed if too many files need to be read. 6. The slowest search (the slowdown in dozens of times) occurs if - any of "Syntax elements" is turned on, - option "Show lexer path for all fragments" is turned on, - lexer path filter is included in the "{incl}" or "{excl}" fields, - styles are copied from source lines from disk files to Results (note: copying styles from tabs is also slowed down but not as much). 7. If engine option "copy_styles" is on and Results has a lot of lines then value of engine option "copy_styles_max_lines" is important. Extra time is directly proportional to the value of the option. So default value 100 (coloring only the first 100 lines) should be well enough. ———————————————————————————————————————————————————————————————————————————————————————————— Special cases. If pattern is regular expresion (".*" is checked) then it can be indirectly multi-line. So in this case, to avoid guessing, plugin checks for single-line or multi-line state to detect which search is needed. If pattern includes "|" or "&" (options "any_all_parts" is on) then plugin sees newline in pattern ("§" for single-line state) to detect which search is needed: no newline - search into each line separately, with newline - search in whole file text. Huge files can also be involved in the search. For optimal memory usage you need to: - Turn off the appending context lines ("-N+M"). - Turn off the multi-line pattern ("+") and remove newline character "§". - Turn off all "Syntax elements". - Turn off "Show lexer path for all fragments". - Ensure no lexer path filters are used. - Turn off engine option "copy_styles". Hint. Start "Fast search" (Shift+F2) to ignore all these options (except lexer path filters) without manually turning them off. Also see engine options - skip_file_size_more(Kb), - dont_show_file_size_more(Kb).
pt_br: Alguns dos parâmetros de pesquisa diminuem ligeiramente a velocidade de pesquisa. Outros reduzem drasticamente a velocidade. Para realizar uma pesquisa ideal, é melhor você considerar estas notas. 1. Os parâmetros . * {reex} aA {case} "w" {palavra} não reduza a velocidade em tudo. 2. Usando configurações não triviais de "Classificar arquivos coletados" ou "Idade dos arquivos" basicamente não reduz a velocidade. 3. Anexar linhas de contexto aos Resultados ("-? +?") Diminui ligeiramente a velocidade. 4. O padrão multilinha ("+") diminui visivelmente a velocidade. 5. O "plano de codificação" inadequado pode reduzir muito a velocidade se muitos arquivos forem necessários para ser lido. 6. A pesquisa mais lenta (a lentidão em dezenas de vezes) ocorre se - qualquer um dos "Elementos da sintaxe" está ativado, - opção "Mostrar caminho lexer para todos os fragmentos" está ativada, - o filtro de caminho lexer está incluído nos campos "{incl}" ou "{excl}", - os estilos são copiados das linhas de origem dos arquivos do disco para os resultados (nota: copiar estilos de guias também fica mais lento, mas não tanto). 7. Se a opção de mecanismo "copy_styles" estiver ativada e os resultados tiverem muitas linhas, o valor de a opção de mecanismo "copy_styles_max_lines" é importante. O tempo extra é diretamente proporcional ao valor da opção. Portanto, o valor padrão 100 (colorindo apenas as primeiras 100 linhas) deve estar bem o suficiente. ——————————————————————————————————--------------------------------------------------------——————————— Casos especiais. Se o padrão for uma expressão regular (". *" Marcado), ele poderá ser indiretamente multilinha. Portanto, neste caso, para evitar suposições, o plug-in verifica o estado de uma ou várias linhas para detectar qual pesquisa é necessária. Se o padrão incluir "|" ou "&" (as opções "any_all_parts" estão ativadas) então o plugin vê a nova linha no padrão ("§" para estado de linha única) para detectar qual pesquisa é necessária: sem nova linha - pesquise cada linha separadamente, com nova linha - pesquisa em todo o texto do arquivo. Arquivos enormes também podem estar envolvidos na pesquisa. Para otimizar o uso da memória, você precisa: - Desligue as linhas de contexto anexas ("-N + M"). - Desative o padrão de várias linhas ("+") e remova o caractere de nova linha "§". - Desligue todos os "Elementos de sintaxe". - Desative "Mostrar caminho lexer para todos os fragmentos". - Certifique-se de que nenhum filtro de caminho lexer seja usado. - Desligue a opção de motor "copy_styles". Dica. Inicie a "Pesquisa rápida" (Shift + F2) para ignorar todas essas opções (exceto filtros de caminho lexer) sem desligá-los manualmente. Veja também as opções do motor - skip_file_size_more (Kb), - dont_show_file_size_more (Kb).

source: Shift+F2 starts the single search, which ignores slowing down options such as: "Extra context lines", "Syntax elements", "Show lexer path for all fragments", "copy_styles" (engine). ———————————————————————————————————————————————————————————————————————————————————————————— Hold Shift-key when clicking ".*" ("Regular Expression") to change the option and also escape/unescape all non-word characters in the pattern. It is guaranteed that the search results will not change because of that. ———————————————————————————————————————————————————————————————————————————————————————————— If field "{excl}" contains " /. " then the root folder(s) will be skipped. ———————————————————————————————————————————————————————————————————————————————————————————— The field "{fold}" can contain many folders to search. Folder names must be independent (no parent-child pairs). The field can also contain both folder mask(s) and {tabs}. ———————————————————————————————————————————————————————————————————————————————————————————— Use \§ to find the character §. Note. Multi-line control shows a pattern with extra newline (known bug). So if pattern ends with a newline, this newline will be stripped from actual search string. ———————————————————————————————————————————————————————————————————————————————————————————— Hotkeys Ctrl+1, ..., Ctrl+9 apply presets #1, ..., #9. Preset can store needed options values. So you can use presets to quickly turn on/off the selected option instead of using the menu. Example. Create preset #1 only with the check on [x]3 ' ' (No extra search options). Create preset #2 only with the check on [x]3 '?/**/?' ("Syntax elements/Outside of comments"). Use Ctrl+1 to quickly clear extra search options without changing others search settings. Use Ctrl+2 to quickly set only "Outside of comments". ———————————————————————————————————————————————————————————————————————————————————————————— You can use macro-vars in any editable fields. E.g. "~ {{t}}" will be auto-replaced to "~ {tabs}". To search the expression with brackets like "{{t}}", type in brackets with backslashes like "\{{t\}}" (or like "\{{t}}", if field doesn't have the outer bracket pair). Engine option "use_selection_on_start" uses selected text from document for the field "Find". Instead of this option, you can use macro-var {{ed:SelectedText}}. This way you can use selected text many times, not only at the start. The macro-var {{ed:CurrentWord}} provides the use of word from the document without selection at all. ———————————————————————————————————————————————————————————————————————————————————————————— How to avoid separate buttons (CudaText and FindInFiles) in the OS app switcher dialog? Set CudaText option ui_taskbar_mode to false.
pt_br: Shift+F2 inicia a pesquisa única, que ignora opções de desaceleração, como: "Linhas extras de contexto", "Elementos de sintaxe", "Exibir caminho lexer para todos os fragmentos", "copy_styles" (motor). ——————————————————————————————————————————————————— —————————————————————————————————————————— Segure a tecla Shift ao clicar em ".*" ("Expressão regular") para alterar a opção e também escape/unescape todos os caracteres não-word no padrão. É garantido que a busca os resultados não mudarão por causa disso. ————————————————————————————————————————————————————————————————————————————————————————————— Se o campo "{excl}" contém "/ ." então as pasta(s) raiz serão ignoradas. ——————————————————————————————————————————————————— —————————————————————————————————————————— O campo "{fold}" pode conter muitas pastas para pesquisar. Os nomes das pastas devem ser independentes (sem pares pai-filho). O campo também pode conter máscara (s) de pasta e {tabs}. —————————————————————————————————————————————————————————————————————————————————————————————- Use \§ para encontrar o caractere §. Observação. O controle multilinha mostra um padrão com nova linha extra (bug conhecido). Então, se o padrão terminar com uma nova linha, essa nova linha será retirada da string de pesquisa real. ————————————————————————————————————————————————————————————----------———————————————————————————. As teclas de atalho Ctrl + 1, ..., Ctrl + 9 aplicam as predefinições # 1, ..., # 9. A predefinição pode armazenar os valores das opções necessárias. Portanto, você pode usar predefinições para ligar / desligar rapidamente a opção selecionada em vez de usar o menu. Exemplo. Crie a predefinição # 1 apenas com a marca de seleção [x] 3 '' (sem opções de pesquisa extras). Crie a predefinição # 2 apenas com a marca de seleção [x] 3 '? / ** /?' ("Elementos de sintaxe / fora dos comentários"). Use Ctrl + 1 para limpar rapidamente as opções extras de pesquisa sem alterar outras configurações de pesquisa. Use Ctrl + 2 para definir rapidamente apenas "Fora dos comentários". ——————————————————————————————————————————————————— ——————————————————————————————————————————— Você pode usar macro-vars em qualquer campo editável. Por exemplo. "~ {{t}}" será substituído automaticamente por "~ {tabs}". Para pesquisar a expressão com colchetes como "{{t}}", digite entre colchetes com barras invertidas como "\ {{t \}}" (ou como "\ {{t}}", se o campo não tiver o par de colchetes externo). Opção de motor "use_selection_on_start" usa o texto selecionado do documento para o campo "Localizar". Em vez desta opção, você pode usar macro-var {{ed: SelectedText}}. Desta forma, você pode usar o texto selecionado muitas vezes, não apenas no início. O macro-var {{ed: CurrentWord}} fornece o uso de palavra do documento sem seleção alguma. ————————————————-------------------------------------------------------------------------------------------------————————————— Como evitar botões separados (CudaText e FindInFiles) na caixa de diálogo do alternador de aplicativos do sistema operacional? Defina a opção ui_taskbar_mode do CudaText como false.

source: Welcome to the plugin's GitHub page
pt_br: Bem-vindo à página GitHub do plugin

source: folders and files picking
pt_br: seleção de pastas e arquivos

source: Fail. Use only for python file.
pt_br: Falha. Utilizar somente para arquivo python.

source: Apply the tunings to controls of all dialogs.
pt_br: Aplicar os ajustes aos controles de todos os diálogos.

source: &Save
pt_br: &Salvar

source: Cancel
pt_br: Cancelar

source: Tuning text vertical alignment for control pairs
pt_br: Ajustando o alinhamento vertical do texto para pares de controle
