Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_ftp.po
Languages: pt_br

source: FTP server info
pt_br: Informações do servidor FTP

source: Choose private key file
pt_br: Escolher o arquivo de chave privada

source: Fill the Host field
pt_br: Preencha o campo Host

source: Fill the Username field
pt_br: Preencha o campo Nome do usuário

source: Server
pt_br: Servidor

source: Server Type:
pt_br: Tipo de Servidor:

source: Port:
pt_br: Porta:

source: Authentication
pt_br: Autenticação

source: Username:
pt_br: Nome do usuário:

source: Password:
pt_br: Senha:

source: Default anonymous login
pt_br: Login anônimo por padrão

source: Ask password every time
pt_br: Sempre perguntar pela senha

source: or Private key:
pt_br: ou Chave privada:

source: Choose file...
pt_br: Escolher arquivo...

source: In OpenSSH format, not .ppk
pt_br: Em formato OpenSSH, não .ppk

source: Misc
pt_br: Diversos

source: Initial remote dir:
pt_br: Diretório remoto inicial:

source: Timeout (seconds):
pt_br: Tempo de espera (segundos):

source: Lable (for menu):
pt_br: Rótulo (para o menu):

source: Use old LIST command
pt_br: Usar LISTA de comando antiga

source: Cancel
pt_br: Cancelar

source: &Cancel
pt_br: &Cancelar
