Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_comments-bkp.po
Languages: pt_br

source: (Line commands) Try to keep text position after (un)commenting
pt_br: (Comandos de linha) Tentar manter a posição do texto após (des)comentar

source: Try to replace only blank(s) to keep text positions:Uncommented lines:····foo1····foo2Commented lines:#···foo1···#foo2
pt_br: Tentar substituir somente os espaços em branco para manter as posições do texto:Linhas não comentadas:····foo1····foo2Linhas comentadas:#···foo1···#foo2

source: (Line "at non-space") If selected few lines, insert comment at maximal common indent
pt_br: (Linha "em não-espaço") Se selecionar algumas linhas, inserir o comentário na indentação comum

source: Use max same column to comment:Uncommented lines:··foo1····foo2······foo3Commented lines:·#foo1·#··foo2·#····foo3
pt_br: Usar a mesma coluna para comentar:Linhas não comentadas:··foo1····foo2······foo3Linhas comentadas:·#foo1·#··foo2·#····foo3

source: (All) Move caret to next line
pt_br: (Todos) Mover cursor para próxima linha

source: Config commenting commands
pt_br: Configurações dos comandos de comentários

source: Cancel
pt_br: Cancelar

source: Lexer "{}" don't support "line comments"
pt_br: Lexer "{}" não tem suporte para "comentário de linha"

source: Commenting
pt_br: Comentários

source: {} works only with normal selection
pt_br: {} funciona somente com seleção normal

source: No stream comment for lexer "{}"
pt_br: Sem comentário de bloco para o lexer "{}"
