Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_fmt.po
Languages: pt_br

source: Formatters for %s
pt_br: Formatadores para %s

source: Formatters:
pt_br: Fomatadores:

source: No formatters for None-lexer
pt_br: Sem formatador para o lexer Nenhum

source: No formatters for "%s"
pt_br: Sem formatador para "%s"

source: No configurable formatters
pt_br: Sem formatadores configuráveis

source: Formatters
pt_br: Fomatadores

source: Cannot open local config for untitled tab
pt_br: Não foi possível abrir a configuração local para guia sem título

source: Formatters labels
pt_br: Rótulos dos formatadores

source: (None)
pt_br: (Nenhum)

source: Label for "%s"
pt_br: Rótulo para "%s"

source: Formatters label "save"
pt_br: Rótulo do formatador "salvar"

source: No formatter for "{}" with label "{}"
pt_br: Sem formatador para "{}" com o rótulo "{}"

source: Global config file "%s" not found
pt_br: Arquivo de configuração global "%s" não encontrado

source: Cannot open local config file for untitled tab
pt_br: Não foi possível abrir o arquivo de configuração local para guia sem título

source: Local config file "%s" not found. Do you want to create it?
pt_br: Arquivo de configuração local "%s" não encontrado. Você deseja criá-lo?

source: Cannot copy global config file "%s" to local folder
pt_br: Não foi possível copiar o arquivo de configuração global "%s" para a pasta local

source: Column selection is not supported
pt_br: Sem suporte para seleção em coluna

source: Formatted {} selections
pt_br: {} seleções formatadas

source: Formatted selection
pt_br: Seleção formatada

source: Cannot format selection(s)
pt_br: Não foi possível formatar selecão(ões)

source: Cannot format text
pt_br: Não foi possível formatar o texto

source: Text is already formatted
pt_br: O texto já está formatado

source: Formatted entire text
pt_br: Texto formatado completamente
