Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_sort.po
Languages: pt_br

source: Document has too many lines. Plugin Sort will not work. Current value of option [sort] max_lines in "settings/plugins.ini" is %d. Instead of Sort plugin, use CudaText built-in commands: "(without undo) sort...".
pt_br: O documento contém muitas linhas. O Plugin de Classificação não funcionará. Valor atual da opção [sort] max_lines em "settings/plugins.ini" é %d. Em vez do plugin de Classificação, utilizar os comandos internos do CudaText: "(sem desfazer) classificar...".

source: Needed multiline selection
pt_br: É necessário a seleção de várias linhas

source: Unknown operation:
pt_br: Operação desconhecida:

source: Lines operation:
pt_br: Operações nas linhas:

source: Cannot extract any lines
pt_br: Não foi possível extrair algumas linhas

source: Extract lines:
pt_br: Extrair linhas:

source: Sorted
pt_br: Classificado

source: , all text
pt_br: , todos os textos

source: , reverse
pt_br: , inverso

source: , ignore case
pt_br: , ignorar maiúsculas e minúsculas

source: , numeric
pt_br: , numérico

source: , offsets
pt_br: , deslocamentos

source: &Sort descending (reverse)
pt_br: Classificação descendente (inverso)

source: &Ignore case
pt_br: &Ignorar maiúsculas e minúsculas

source: Delete d&uplicate lines
pt_br: Excluir linhas d&uplicadas

source: Delete &blank lines
pt_br: Excluir linhas em &branco

source: Numeric (treat beginning as number)
pt_br: Numérico (trate o início como um número)

source: Sort only by substring, offsets 0-based:
pt_br: Classificar apenas por substring, deslocamentos em 0:

source: &From:
pt_br: &De:

source: &To:
pt_br: &Para:

source: Cancel
pt_br: Cancelar

source: Sort
pt_br: Classificação

source: Incorrect offsets: {}..{}
pt_br: Deslocamentos incorretos: {}..{}

source: No e-mails in text
pt_br: Sem e-mails no texto

source: Sorted text as email list
pt_br: Texto classificado como lista de e-mails

source: Sorted ini lines
pt_br: Linhas ini classificadas

source: Sort: separator chars
pt_br: Classificar: caracteres separadores

source: Separator of prefix, to skip prefix (optional):
pt_br: Separador de prefixo, para pular o prefixo (opcional):

source: Separator of values after prefix:
pt_br: Separador de valores após o prefixo:

source: Separators must have length=1
pt_br: Os separadores devem ter length=1

source: Separators cannot be the same
pt_br: Os separadores não podem ser iguais

source: Changed %d line(s)
pt_br: %d de linha(s) alteradas

source: No lines were changed
pt_br: As linhas não foram alteradas
