Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_sync_editing.po
Languages: pt_br

source: Sync Editing: Need single caret
pt_br: Edição Sincronizada: É necessário cursor único

source: Sync Editing: Make selection first
pt_br: Edição Sincronizada: Selecione primeiro

source: Sync Editing: Cannot find IDs in selection
pt_br: Edição Sincronizada: Não foi possível encontrar IDs na seleção

source: Sync Editing: Need several IDs in selection
pt_br: Edição Sincronizada: É necessário vários IDs na seleção

source: Sync Editing: Cancel? Click somewhere else to cancel, or on ID to continue.
pt_br: Edição Sincronizada: Cancelar? Clique em outro lugar para cancelar, ou em ID para continuar.

source: Sync Editing: Click on ID to edit it, or somewhere else to cancel
pt_br: Edição Sincronizada: Clique no ID para editar, ou

source: Sync Editing: Cancelled
pt_br: Edição Sincronizada: Cancelada

source: Sync Editing: Not a word! Click another, or click somewhere else again
pt_br: Edição Sincronizada: Não é uma palavra! Clique em outro, ou

source: Do you want to cancel Sync Editing mode?
pt_br: Deseja cancelar o modo de Edição Sincronizada?

source: To configure Sync Editing, open lexer-specific config in CudaText (Options / Settings-more / Settings lexer specific) and write there options: case sensitive, regular expression for identifiers: "case_sens": true, // case sensitive search "id_regex": "\w+", // regex to find id's "id_styles": "(?i)id[\w\s]*", // use tokens with these styles "id_styles_no": "(?i).*keyword.*", // ignore tokens with these styles "syncedit_naive_mode": false, // use 'naive' algorithm (search without lexer analysis, e.g. for plain text) Also you can write to CudaText's user.json these options: "syncedit_mark_words": true, // allows fancy colorizing of words in selection "syncedit_ask_to_exit": true, // show confirmation before auto-cancelling
pt_br: Para configurar a Edição Sincronizada, abrir a configuração específica do lexer no CudaText (Opções / Configurações - Específicas do lexer) e escrever as opções: distinção entre maiúsculas e minúsculas, expressão regular para identificadores: "case_sens": true, // pesquisar com distinção entre maiúsculas e minúsculas "id_regex": "\w+", // expressão regular para encontrar id's "id_styles": "(?i)id [\w\s]*", // usar tokens com esses estilos "id_styles_no": "(?i).*keyword.*", // ignorar tokens com esses estilos "syncedit_naive_mode": false, // usar o algoritmo 'ingênuo' (pesquisar sem análise lexer, p. ex. para texto simples) Além disso, você pode escrever no user.json do CudaText estas opções: "syncedit_mark_words": true, // permitir colorização de palavras na seleção "syncedit_ask_to_exit": true, // exibir confirmação antes do cancelamento automático
