Repository: eltonfabricio10/cuda_lang_pt_BR
Catalog: langpy/extras/cuda_snippets.po
Languages: pt_br

source: No snippets for current lexer
pt_br: Nenhum trecho para o lexer atual

source: Snippets
pt_br: Trechos

source: Loading VS Snippets list. Please wait...
pt_br: Carregando lista de Trechos VS. Por favor, aguarde...

source: Can't download VS Snippets. Try again later...
pt_br: Não foi possível baixar Trechos VS. Tentar novamente mais tarde...

source: Delete snippet markers
pt_br: Excluir marcadores de trechos

source: No VSCode snippets found
pt_br: Trechos VSCode não encontrados

source: Visit page of snippets
pt_br: Visitar página dos trechos

source: No URL found
pt_br: URL não encontrada

source: Opened:
pt_br: Aberto:

source: Remove snippets
pt_br: Remover trechos

source: Snippets folder removed; restart CudaText to forget about it
pt_br: Pasta de trechos removida; reiniciar o CudaText para esquecer disso

source: Setup snippet lexer(s)
pt_br: Configurar trechos do lexer(s)

source: You must check at least one CudaText lexer, for snippets to work
pt_br: Você deve verificar pelo menos um lexer do CudaText, para os trechos funcionarem

source: Search snippets
pt_br: Pesquisar trechos

source: Installing:
pt_br: Instalando:

source: Manage snippets
pt_br: Gerenciar trechos

source: Cancel
pt_br: Cancelar

source: Editor's Lexer
pt_br: Editor de Lexer

source: Macros Help
pt_br: Ajuda de Macros

source: Package:
pt_br: Pacote:

source: Delete...
pt_br: Excluir...

source: Add...
pt_br: Adicionar...

source: Group:
pt_br: Grupo:

source: Group's lexers:
pt_br: Grupo de lexers:

source: Add Lexer...
pt_br: Adicionar Lexer...

source: Snippet:
pt_br: Trechos:

source: Snippet's alias:
pt_br: Apelido do trecho:

source: Saving changes
pt_br: Salvando alterações

source: * Group's lexers changed: [{0}] => [{1}]
pt_br: * Grupo de lexers alterados: [{0}] => [{1}]

source: * snippet's alias changed: [{0}] => [{1}]
pt_br: * apelidos dos trechos alterados: [{0}] => [{1}]

source: * snippet's body changed: {0} ==>> {1}
pt_br: * corpo dos trechos alterados: {0} ==>> {1}

source: ! ERROR: trying to save snippets for unloaded group: {0}
pt_br: ! ERRO: tentando salvar trechos para grupo não carregado: {0}

source: Saved.
pt_br: Salvo.

source: New snippet name:
pt_br: Novo nome de trecho:

source: "{0}" - snippet already exists.
pt_br: "{0}" - trecho já existe.

source: New snippet group filename:
pt_br: Novo nome de arquivo para grupo de trechos:

source: "{0}" - group already exists.
pt_br: "{0}" - grupo já existe.

source: New package name (should be a valid directory name):
pt_br: Novo nome de pacote (deve ser um nome de diretório válido):

source: "{0}" - package already exists.
pt_br: "{0}" - pacote já existe.

source: To delete package "{}" - delete the following directory:
pt_br: Para excluir o pacote "{}" - remova o seguinte diretório:

source: To delete snippet group "{0}" from package "{1}" - delete the following file:
pt_br: Para excluir o grupo de trechos "{0}" do pacote "{1}" - remova o seguinte arquivo:

source: Delete snippet "{0}"?
pt_br: Excluir trecho "{0}"?

source: ! ERROR: snippets path is not a file:{0}
pt_br: ! ERRO: o caminho dos trechos não é um arquivo:{0}

source: ! ERROR: no such package: {0}
pt_br: ! ERRO: o pacote não existe: {0}

source: ! ERROR: {0} - is not a package
pt_br: ! ERRO: {0} - não é um pacote

source: Syntax Help
pt_br: Ajuda de Sintaxe

source: Package of snippets converted.
pt_br: Pacote de trechos convertidos.

source: It is not a snippets package.
pt_br: Isso não é um pacote de trechos.

source: Wrong snippet: {}
pt_br: Trecho errado: {}

source: Connection error :(
pt_br: Erro de conexão :(

source: Can't install this package
pt_br: Não foi possível instalar este pacote

source: Sorry, but this package doesn't have any snippets
pt_br: Desculpe, mas este pacote não contém trechos

source: Can't download this package. Status code {}
pt_br: Não foi possível baixar este pacote. Código do status {}
